//
//  JZ_03_1不修改数组找出重复的数字.swift
//  算法学习
//
//  Created by 冯才凡 on 2021/2/21.
//  Copyright © 2021 冯才凡. All rights reserved.
//

import Foundation
extension JZ {
    /*
     题目：不修改数组找出重复的数
     在一个长度为n的数组里的所有数字都在0~n-1的范围内。数组中某些数字是重复的，但不知道有几个数字重复了，也不知道每个数字重复了几次。请找出数组中任意一个重复的数字，但不能修改输入的数组。
     例如，如果输入长度为7的数组{2，3，5，4，3，2，6，7}，那么对应的输出是重复的2或3
     */


    /*
     方法一：还是可以使用哈希表，但是会多处O(n)的大小辅助空间
     */
    
    /*
     方法二
     */
    func getDuplicate(numbers:[Int]) -> [Int] {
        return []
    }
}
